Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: *Logging*: Gitolite logs all successful accesses.
cs: *Logování:* Gitolite loguje všechny úspěšné přístupy.

source: *Mirroring*: Gitolite can help you maintain multiple mirrors, and switch between them easily if the primary server goes down.
cs: *Zrcadlení:* Gitolite vám pomůže se správou více zrcadel a při výpadku hlavního serveru můžete snadno přepnout na jiný.

source: *Chapter 4* will introduce all of the available options the server can set up to access your Git repository and the pros and cons of each.
cs: V _kapitole 4_ budou představeny všechny dostupné možnosti, které mohou být pro přístup do repozitáře Git na serveru nastaveny, včetně jejich předností a nevýhod.

source: *Tracked* files are files that were in the last snapshot; they can be _unmodified_, _modified_, or _staged_.
cs: Za _sledované_ jsou označovány soubory, které byly součástí posledního snímku. Mohou být ve stavu _změněn_ (modified), _nezměněn_ (unmodified) nebo _připraven k zapsání_ (staged).

source: *Untracked* files are everything else — any files in your working directory that were not in your last snapshot and are not in your staging area.
cs: *Nesledované* soubory jsou všechny ostatní, tedy veškeré soubory ve vašem pracovním adresáři, které nebyly obsaženy ve vašem posledním snímku a nejsou v oblasti připravených změn.

source: - Bullet points are okay, too
cs: - Můžete používat i odrážky.

source: - Typically a hyphen or asterisk is used for the bullet, preceded by a single space, with blank lines in between, but conventions vary here
cs: - Jako odrážka se nejčastěji používá pomlčka nebo hvězdička, před ně se vkládá jedna mezera, mezi body výčtu prázdný řádek, avšak úzus tu není jednotný.

source: - print help
cs: - zobrazit nápovědu

source: --abbrev-commit Show only the first few characters of the SHA-1 checksum instead of all 40.
cs: --abbrev-commit Zobrazí pouze prvních několik znaků kontrolního součtu SHA-1 místo všech 40.

source: --author Only show commits in which the author entry matches the specified string.
cs: --author Zobrazí pouze revize, v nichž autor odpovídá zadanému řetězci.

source: --committer Only show commits in which the committer entry matches the specified string.
cs: --committer Zobrazí pouze revize, v nichž autor revize odpovídá zadanému řetězci.

source: --graph Display an ASCII graph of the branch and merge history beside the log output.
cs: --graph Zobrazí vedle výstupu logu ASCII graf k historii větve a slučování.

source: --name-only Show the list of files modified after the commit information.
cs: --name-only Za informacemi o revizi zobrazí seznam změněných souborů.

source: --name-status Show the list of files affected with added/modified/deleted information as well.
cs: --name-status Zobrazí seznam dotčených souborů spolu s informací přidáno/změněno/smazáno.

source: --oneline A convenience option short for `--pretty=oneline --abbrev-commit`.
cs: --oneline Užitečná zkratka pro `--pretty=oneline --abbrev-commit`.

source: --pretty Show commits in an alternate format.
cs: --pretty Zobrazí revize v alternativním formátu.

source: --relative-date Display the date in a relative format (for example, “2 weeks ago”) instead of using the full date format.
cs: --relative-date Zobrazí datum v relativním formátu (např. "2 weeks ago", tj. před 2 týdny) místo formátu s úplným datem.

source: --shortstat Display only the changed/insertions/deletions line from the --stat command.
cs: --shortstat Zobrazí pouze řádek změněno/vloženo/smazáno z příkazu --stat.

source: --stat Show statistics for files modified in each commit.
cs: --stat Zobrazí statistiku pro změněné soubory v každé revizi.

source: --until, --before Limit the commits to those whose CommitDate was made on-or-before the specified date/time.
cs: --until, --before Omezí výpis na revize provedené před zadaným datem.

source: --word-diff Show the patch in a word diff format.
cs: --word-diff Zobrazí záplatu ve tvaru rozdílu po slovech.

source: 2^80 is 1.2 x 10^24 or 1 million billion billion.
cs: 2^80 je 1,2 * 10^24, neboli 1 milion miliard miliard.

source: <!-- Attention to translators: this is a table declaration.
cs: <!-- Poznámka pro překladatele: toto je zápis tabulky.

source: A Git clone gives you your own master branch and origin/master pointing to origin’s master branch.
cs: Příkaz git clone vám vytvoří vlastní hlavní větev a větev origin/master, ukazující na hlavní větev serveru origin.

source: A GitHub main project page.
cs: Hlavní stránka projektu na serveru GitHub

source: A Perforce importer is also distributed with Git.
cs: Také importér Perforce je distribuován se systémem Git.

source: A SHA-1 hash looks something like this:
cs: Otisk SHA-1 může vypadat například takto:

source: A VCS allows you to: revert files back to a previous state, revert the entire project back to a previous state, review changes made over time, see who last modified something that might be causing a problem, who introduced an issue and when, and more.
cs: VCS umožňuje vrátit jednotlivé soubory nebo celý projekt do předchozího stavu, porovnávat změny provedené v průběhu času, zjistit, kdo naposledy upravil něco, co nyní možná způsobuje problémy, kdo vložil jakou verzi a kdy a mnoho dalšího.

source: A `**/` pattern is available in Git since version 1.8.2.
cs: Část masky `**/` je v Gitu dostupná od verze 1.8.2.

source: A benefit of this approach is that you can more specifically define the relationships between the projects with tags and branches in the superprojects.
cs: Výhodou tohoto postupu je, že můžete podrobněji definovat vztah mezi projekty se značkami a větvemi v superprojektech.

source: A bit later, you’ll learn how to verify signed tags.
cs: V dalších částech se naučíte, jak podepsané značky ověřovat.

source: A branch in Git is simply a lightweight movable pointer to one of these commits.
cs: Větev je v systému Git jen snadno přemístitelným ukazatelem na jednu z těchto revizí.

source: A cherry-pick in Git is like a rebase for a single commit.
cs: Částečné převzetí lze v systému Git přirovnat k přeskládání jedné revize.

source: A common issue arises in these scenarios: you want to be able to treat the two projects as separate yet still be able to use one from within the other.
cs: V obou případech se budete potýkat se stejným problémem: oba projekty chcete zachovat samostatné, a přesto potřebujete používat jeden v rámci druhého.

source: A common switch to use with the `log` command in this case is `--left-right`, which shows you which side of the range each commit is in.
cs: Přepínačem, který se v tomto případě běžně používá v kombinaci s příkazem `log`, je parametr `--left-right`. Příkaz pak zobrazí, na jaké straně intervalu se ta která revize nachází.

source: A contributor clones that repository and makes changes.
cs: Přispěvatel naklonuje tento repozitář a provede změny.

source: A fallthrough results in access being denied.
cs: Pokud není nalezeno nic, je přístup zamítnut.

source: A few prebuilt options are available for you to use.
cs: K dispozici máte několik přednastavených možností.

source: A good way to do this in Git is to make each of the subdirectories a separate Git repository and then create superproject Git repositories that contain multiple submodules.
cs: Dobrým způsobem, jak to v systému Git provést, je učinit ze všech podsložek oddělené repozitáře Git a vytvořit repozitáře superprojektu Git, které budou obsahovat několik submodulů.

source: A higher probability exists that every member of your programming team will be attacked and killed by wolves in unrelated incidents on the same night.
cs: To už je pravděpodobnější, že všichni členové vašeho programovacího týmu budou během jedné noci v navzájem nesouvisejících incidentech napadeni a zabiti smečkou vlků.

source: A history with a topic branch off another topic branch.
cs: Historie s tematickou větví obsahující další tematickou větev.

source: A huge number and variety of options to the `git log` command are available to show you exactly what you’re looking for.
cs: K příkazu `git log` je k dispozici velké množství nejrůznějších parametrů, díky nimž můžete zobrazit přesně to, co potřebujete.

source: A lightweight tag is very much like a branch that doesn’t change — it’s just a pointer to a specific commit.
cs: Prostá značka se velmi podobá větvi, která se nemění – je to pouze ukazatel na konkrétní revizi.

source: A list of collaborators on your project.
cs: Seznam spolupracovníků na projektu

source: A local repository is fast only if you have fast access to the data.
cs: Lokální repozitář je rychlý pouze v případě, že máte rychlý přístup k datům.

source: A lot of code exchange in the Git world happens by "please pull" requests.
cs: Hodně výměny kódu probíhá v otevřeném gitovém světě metodou „prosím stáhněte si“.

source: A lot of people become concerned at some point that they will, by random happenstance, have two objects in their repository that hash to the same SHA-1 value.
cs: Někteří uživatelé bývají zmateni, že mohou mít v repozitáři – shodou okolností – dva objekty, které mají stejnou hodnotu SHA-1 otisku.

source: A new text box appears, into which you can type a username.
cs: Zobrazí se nové textové pole, do nějž můžete zadat jméno uživatele.

source: A nice way of quickly getting a sort of changelog of what has been added to your project since your last release or e-mail is to use the `git shortlog` command.
cs: Elegantním způsobem, jak rychle získat určitý druh záznamu o změnách (changelog), které byly do projektu přidány od posledního vydání nebo e-mailu, je použít příkaz `git shortlog`.

source: A normal Git repository looks more like this:
cs: Běžný repozitář Git vypadá naproti tomu spíš takto:

source: A number of developers are nodes — consumers of that hub — and synchronize to that one place (see Figure 5-1).
cs: Několik vývojářů představuje jednotlivé uzly (nodes) – uživatele centrálního místa – které se podle tohoto místa synchronizují (viz obrázek 5-1).

source: A number of examples of more complex scenarios are available in the `contrib/fast-import` directory of the Git source code; one of the better ones is the `git-p4` script I just covered.
cs: Několik příkladů složitějších scénářů si můžete prohlédnout v adresáři `contrib/fast-import` ve zdrojovém kódu Git. Jedním z těch nejlepších je už zmíněný skript`git-p4`.

source: A number of options can help you set the coloring to your preference.
cs: S individuálním nastavením barev vám pomůže celá řada možností.

source: A push to the project takes the `gitosis.conf` file you just pushed up and sticks it there.
cs: Po odeslání dat do projektu bude soubor `gitosis.conf`, který jste právě odeslali, umístěn do tohoto adresáře.

source: A remote repository is generally a _bare repository_ — a Git repository that has no working directory.
cs: Vzdálený repozitář je obvykle _holý repozitář_ (bare repository), tj. gitový repozitář bez pracovního adresáře.

source: A repository on NFS is often slower than the repository over SSH on the same server, allowing Git to run off local disks on each system.
cs: Repozitář na NFS je často pomalejší než stejný repozitář nad SSH na tomtéž serveru, který ve všech systémech umožňuje spustit Git z lokálních disků.

source: A rewind push to those refs does not match the first rule, drops down to the second, and is therefore denied.
cs: Odeslání, která vracejí změny (rewind push) do těchto větví, neodpovídají prvnímu pravidlu. Porovnají se tedy s druhým pravidlem a na jeho základě budou zamítnuty.

source: A second method is to create a single 'git' user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the `~/.ssh/authorized_keys` file of your new 'git' user.
cs: Druhým způsobem je vytvořit na počítači jediného uživatele 'git', požádat všechny uživatele, kteří mají mít oprávnění k zápisu, aby vám poslali veřejný SSH klíč, a přidat tento klíč do souboru `~/.ssh/authorized_keys` vašeho nového uživatele 'git'.

source: A short and simple commit history.
cs: Krátká a jednoduchá historie revizí

source: A simple way to get the commit message from a commit when you have the SHA-1 value is to go to the first blank line and take everything after that.
cs: Jednoduchým způsobem, jak z revize, k níž máte hodnotu SHA-1, extrahovat její zprávu, je přejít k prvnímu prázdnému řádku a vzít vše, co následuje za ním.

source: A single tree object contains one or more tree entries, each of which contains a SHA-1 pointer to a blob or subtree with its associated mode, type, and filename.
cs: Jeden objekt stromu obsahuje jednu nebo více položek stromu, z nichž každá obsahuje ukazatel SHA-1 na blob nebo podstrom s asociovaným režimem, typem a názvem souboru.

source: A topic branch is a short-lived branch that you create and use for a single particular feature or related work.
cs: Tematická větev (topic branch) je krátkodobá větev, kterou vytvoříte a používáte pro jediný konkrétní účel nebo práci.

source: A way to remember this command is by recalling the `git push [remotename] [localbranch]:[remotebranch]` syntax that we went over a bit earlier.
cs: Zapamatovat si jej ale můžete tak, že si vybavíte příkaz `git push [vzdálený server] [lokální větev]:[vzdálená větev]`, o kterém jsme se zmínili před chvílí.

source: Add the following line to your `.gitattributes` file:
cs: Do souboru `.gitattributes` přidejte následující řádek:

source: Add the repo.rb file from the Grit library you worked with earlier — this is about a 12K source code file:
cs: Z knihovny Grit, s níž jsme pracovali před časem, přidejte soubor „repo.rb“. Je to soubor se zdrojovým kódem o velikosti asi 12 kB:

source: Add, commit, and push the change, and the user has been added.
cs: Přidáme, potvrdíme a odešleme změny (add, commit, push). Tím jsme dosáhli přidání uživatele.

source: Adding a collaborator to your project.
cs: Přidání spolupracovníka do projektu

source: Adding another server as a remote.
cs: Přidání dalšího vzdáleného serveru.

source: Adding users is easy.
cs: Přidávání dalších uživatelů je snadné.

source: Administrators have fine-grained control over who can do what; and it’s far easier to administer a CVCS than it is to deal with local databases on every client.
cs: Kromě toho je podstatně jednodušší spravovat CVCS, než pracovat s lokálními databázemi na jednotlivých klientech.

source: After a few seconds, you’re taken to your new project page, which indicates that this project is a fork of another one (see Figure 4-15).
cs: Po několika sekundách přejdete na novou stránku svého projektu, která oznamuje, že je tento projekt odštěpen (fork) z jiného projektu (viz obrázek 4-15).

source: After a topic branch merge.
cs: Po začlenění tematické větve

source: After a topic branch release.
cs: Po vydání tematické větve

source: After all this is set, if you run diff commands such as this:
cs: Až dokončíte celé nastavení, můžete spustit příkaz diff, např.:

source: After it’s installed, you have both a command-line version (including an SSH client that will come in handy later) and the standard GUI.
cs: Po dokončení instalace budete mít k dispozici jak verzi pro příkazový řádek (včetně SSH klienta, který se vám bude hodit později), tak standardní grafické uživatelské rozhraní.

source: After it’s tested, merge the hotfix branch, and push to production.
cs: Po úspěšném otestování začleníte větev s hotfixem a odešlete ji do produkce.

source: After that come the line number and the content of the file.
cs: Za tímto údajem následuje číslo řádku a obsah souboru.

source: After the entire commit process is completed, the `post-commit` hook runs.
cs: Po dokončení celého procesu zapisování revize se spustí zásuvný modul `post-commit`.

source: After these three commands, you end up with a single commit — the second commit replaces the results of the first.
cs: Provedení uvedených tří příkazů zůstane jediná revize – druhý příkaz `commit` nahradí výsledky prvního.

source: After they integrate these branches into the mainline, a fetch will bring down the new merge commits, making the commit history look like Figure 5-14.
cs: Poté, co budou tyto větve do hlavní linie integrovány, vyzvednutím dat bude možné stáhnout nové revize vzniklé začleněním změn a historie revizí bude vypadat jako na obrázku 5-14.

source: After this comes a Commands section.
cs: Za seznamem změn následuje část Commands (Příkazy).

source: After this is done, you can also get Git via Git itself for updates:
cs: Po dokončení instalace můžete rovněž vyhledat aktualizace systému Git prostřednictvím systému samotného:

source: After this is done, you can use `git send-email` to send your patches:
cs: Jakmile je to hotové, můžete záplaty odeslat příkazem `git send-email`:

source: After two more commits, your history might look something like Figure 3-2.
cs: Po dalších dvou revizích bude vaše historie vypadat jako na obrázku 3-2.

source: After you commit and push that change, all four users will be able to read from and write to that project.
cs: Až tuto změnu zapíšete a odešlete, všichni čtyři uživatelé budou moci z tohoto projektu číst a zapisovat do něj.

source: After you do that, your commit history will contain both the C4 and C4' commits, which have different SHA-1 hashes but introduce the same work and have the same commit message.
cs: Vaše historie pak bude obsahovat revize C4 i C4’, které mají obě jiný otisk SHA-1, ale představují stejnou práci a nesou i stejnou zprávu k revizi.

source: After you do this, you should have references to all the branches from that remote, which you can merge in or inspect at any time.
cs: Poté byste měli mít k dispozici odkazy na všechny větve tohoto vzdáleného projektu. Od toho okamžiku je můžete kdykoli slučovat nebo prohlížet.

source: After you exit the merge tool, Git asks you if the merge was successful.
cs: Až nástroj pro slučování zavřete, Git se vás zeptá, zda sloučení proběhlo úspěšně.

source: After you have created several commits, or if you have cloned a repository with an existing commit history, you’ll probably want to look back to see what has happened.
cs: Až vytvoříte několik revizí nebo pokud naklonujete repozitář s existující historií revizí, možná budete chtít nahlédnout do historie projektu.

source: After you merge one branch into another, you can’t easily go back and continue working on that branch, as you normally can in Git.
cs: Poté, co začleníte jednu větev do druhé, můžete se beze všeho vrátit zpět a pokračovat v práci na této větvi, stejně jako byste mohli v systému Git.

source: After you push your project up or have it imported from Subversion, you have a main project page that looks something like Figure 4-13.
cs: Po odeslání projektu nebo jeho naimportování ze systému Subversion budete mít hlavní stránku projektu, která bude vypadat přibližně jako na obrázku 4-13.

source: After you run a successful `git checkout`, the `post-checkout` hook runs; you can use it to set up your working directory properly for your project environment.
cs: Po úspěšném spuštění příkazu `git checkout` se spustí zásuvný modul `post-checkout`. Ten slouží k nastavení pracovního adresáře podle potřeb prostředí vašeho projektu.

source: After your super-important fix is deployed, you’re ready to switch back to the work you were doing before you were interrupted.
cs: Poté, co jste dokončili práci na bezodkladné opravě, můžete přepnout zpět na práci, jíž jste se věnovali před telefonátem.

source: After you’ve resolved each of these sections in each conflicted file, run `git add` on each file to mark it as resolved.
cs: Poté, co vyřešíte všechny tyto části ve všech kolidujících souborech, spusťte pro každý soubor příkaz `git add`, jímž ho označíte jako vyřešený.

source: Again, GitWeb can be served with any CGI capable web server; if you prefer to use something else, it shouldn’t be difficult to set up.
cs: Znovu připomeňme, že GitWeb může být obsluhován jakýmkoli webovým serverem podporujícím CGI. Chcete-li používat jakýkoli jiný server, nemělo by být nastavení obtížné.

source: Again, having multiple long-running branches isn’t necessary, but it’s often helpful, especially when you’re dealing with very large or complex projects.
cs: Není nutné používat při práci několik dlouhých větví, ale často to může být užitečné, zejména pokud pracujete ve velmi velkých nebo komplexních projektech.

source: Again, if you don’t specify a stash, Git assumes the most recent stash:
cs: Jestliže nespecifikujete konkrétní odklad, Git předpokládá odklad poslední:

source: Again, it doesn’t show commits that you did locally in Git or that have been pushed to Subversion in the meantime.
cs: Ani tento příkaz nezobrazuje revize zapsané lokálně v systému Git a revize odeslané na server Subversion od posledního připojení.

source: Again, the public keys look something like this:
cs: Veřejné klíče vypadají opět nějak takto:

source: Again, this generally does nothing.
cs: I tentokrát platí, že příkaz většinou neprovede nic.

source: Again, this gives you normal `log` output but shows you only the commit information for those four commits, appearing in the traditional commit date ordering.
cs: Výstupem příkazu bude běžný výpis příkazu `log`, ale zobrazí se pouze informace o těchto čtyřech revizích, uspořádané v tradičním pořadí podle data zapsání.

source: Again, this is for unauthenticated read-only access.
cs: I v tomto případě se jedná o přístup pouze pro čtení bez ověřování totožnosti.

source: Again, this will cause a `git push origin` to push the local `master` branch to the remote `qa/master` branch by default.
cs: Touto hodnotou zajistíte, že bude příkaz `git push origin` odesílat lokální větev `master` do vzdálené větve `qa/master`.

source: Again, you can use any web server for this; but as an example, we’ll demonstrate some basic Apache configurations that should give you an idea of what you might need.
cs: Opět, můžete použít jakýkoli webový server. Pro názornost ale ukážeme některá základní nastavení serveru Apache, abyste získali představu, co vás může čekat.

source: Again, you need to do this only once if you pass the `--global` option, because then Git will always use that information for anything you do on that system.
cs: Použijete-li parametr `--global`, pak také toto nastavení stačí provést pouze jednou. Git bude používat tyto údaje pro všechny operace, které v systému uděláte.

source: Again, you simply follow the rules top down until you hit a match for your access mode, or a deny.
cs: Pravidla se budou opět procházet shora dolů až do momentu, kdy narazíte na shodu s vaším režimem přístupu nebo na pravidlo typu odmítnutí (deny).

source: Ahh, but the bliss of rebasing isn’t without its drawbacks, which can be summed up in a single line:
cs: Přeskládání sice nabízí určité výhody, má však také svá úskalí. Ta se dají shrnout do jedné věty:

source: All Git objects are stored the same way, just with different types — instead of the string blob, the header will begin with commit or tree.
cs: Všechny objekty Git se ukládají stejným způsobem, jen s odlišným typem. Místo řetězce blob bude záhlaví začínat řetězcem „commit“ (u revize) nebo „tree“ (u stromu).

source: All of these fields are delimited by a pipe (`|`) character.
cs: Všechna tato pole jsou oddělena svislicí (`|`).

source: All that’s left is to specify the file contents for each snapshot.
cs: Teď už zbývá jen určit obsah souborů všech snímků.

source: All the Git commands work independently in the two directories:
cs: Všechny příkazy Git pracují v obou adresářích nezávisle:

source: All the changes from your Rack project are merged in and ready to be committed locally.
cs: Všechny změny z projektu Rack budou začleněny a budete je moci lokálně zapsat.
